//ЗАДАНИЕ
//Это ласт задачка на классы. Добавить как поля длина и угол в полярной СК. Дописать методы:
//перевод в ПСК  
//вычитание(-и -= )  
//умножение на число(*и *= )  
//деление на число(/ и /= )
//скалярное умножение(*и *= )
//сравнение(== и != )
//косое скалярное произведение(формулку глянуть в инете)
//нормализация вектора
//поменять длину, сохранив направление
//поменять угол, сохранив длину
//косинусное расстояние между векторами

#include <iostream>
#include <cmath>
#include "DZ 6 vector.h"  //присоединение заголовков
using namespace std;

int main() {
    setlocale(0, "rus");
    cout << "Создадим 2 вектора a(1,1) и b(2, 3) " << endl;
    Vector2 a(1, 1);
    Vector2 b(2, 3);

    //перевод в полярные координаты
    cout << "a(r, phi):  " << a.p << "   " << a.phi << endl;
    cout << "b(r, phi):  " << b.p << "   " << b.phi << endl;

    //сложение
    Vector2 c = a + b;
    cout <<"a+b       " << c.x << " " << c.y << endl;
    c += a;
    cout <<"(a+b)+=a  " << c.x << " " << c.y << endl;

    //вычитание
    Vector2 d = a - b;
    cout << "a-b      " << d.x << " " << d.y << endl;
    d -= a;
    cout << "(a-b)-=a " << d.x << " " << d.y << endl;

    //деление на число
    d = b/2;
    cout << "b/2       " << d.x << " " << d.y << endl;

    //умножение на число
    d = a * 3;
    cout << "a*3       " << d.x << " " << d.y << endl;

    //сравнение
    cout <<"a==b ?     " << (a == b) << endl;
    cout <<"a!=b ?     " << (a != b) << endl;

    //косое скалярное произведение
    cout <<"a/*b       " << a.skew_scalar_product(b) << endl;

    //скалярное произведение
    cout << "a*b       " << a.scalar_product(b) << endl;

    //косинусное расстояние между векторами
    cout << "a cos b       " << a.cos_phi(b) << endl;

    //вычисление нормы
    c = a;
    c.norm();
    cout << "a/|a|     " << c.x << " " << c.y << endl;
    
    //меняем длину вектора
    cout << endl;
    cout << "Меняем длину вектора b." << endl;
    cout << "Было:      " << b.getLen() << endl;
    b.change_len(7);
    cout << "Стало:     " << b.getLen() << endl; 
    cout << "Новые x y: " << b.x << " " << b.y << endl;
    cout << endl;

    return 0;
}

